[{
 "date": "March 29, 2015",
 "job_title": "Human Resources was asked...",
 "interview_question": "Q: Are you open to working long hours?"
},
{
 "date": "September 28, 2012",
 "job_title": "Director Human Resources was asked...",
 "interview_question": "How will ensure that attrition is with acceptable limits of 5 to 8% ?"
},
{
 "date": "August 31, 2022",
 "job_title": "HR Advisor was asked...",
 "interview_question": "Tell me about your experience"
},
{
 "date": "July 13, 2017",
 "job_title": "Vice President of Human Resources was asked...",
 "interview_question": "Asked what I would have done if the CEO asked me to a meeting?"
},
{
 "date": "March 10, 2019",
 "job_title": "Human Resources Administrator was asked...",
 "interview_question": "tell me about your self"
},
{
 "date": "March 14, 2018",
 "job_title": "Human Resources Manager was asked...",
 "interview_question": "what is recruitment"
},
{
 "date": "October 6, 2017",
 "job_title": "Human Resources Assistant was asked...",
 "interview_question": "Where do you see yourself in 5 years?"
},
{
 "date": "November 17, 2018",
 "job_title": "Hopeless Ill-mannered Human Resources was asked...",
 "interview_question": "Read the resume and tell about ur family."
},
{
 "date": "June 30, 2022",
 "job_title": "HR- Recruiter was asked...",
 "interview_question": "Tell me about yourself Your work experience"
},
{
 "date": "June 30, 2015",
 "job_title": "Personal Assistant and Marketing Position was asked...",
 "interview_question": "Nothing of any significance. He had seen my resume online...brings me in and tells me, given my resume and experience (which I am more than aware of), he would rather put me in a marketing position. Something I've been very successful in for 30 years (I was just looking for a semi-retirement mindless job)...so then he wanted me to apply my many years of marketing knowledge. As I told him, \"That's a whole different ball game than being a personal assistant.\" He sends me an offer letter with a title below any I have ever held, even out of college with a salary less than the personal assistant job...something I had not made since 1984. SURELY YOU JEST!! The pompous arrogance is unbelievable. I countered with two offers and he just never returned my call and that was the end of that. How immature these arrogant people are and trust me, the arrogance is completely unfounded. I would stay away. I should have taken heed of the previous Glassdoor comments. I did take note before going in as to how low his CEO rating was and, it is even lower in my opinion. The second I walked in, he spouts out some negative comment about the great GPS system I used to find his office (which he said people have a hard time finding.) I didn't. He then proceeds to bash two of his current employees. He has no business working with people or making job offers. He is obviously just plain greedy and clueless. Most people who exude such arrogance are just negative, insecure people on power trips and the describes the CEO of Big Red, in my opinion. DO NOT WORK HERE!!"
},
